document.addEventListener('DOMContentLoaded', function() {
const queryString = window.location.search.split('?')[1]; // 获取 URL 中的查询参数
const infoImage = document.getElementById('max_img'); // 获取图片元素
const max_title = document.querySelector('.max_title'); // 艺人名
const am_link = document.getElementById('am_link'); // Apple Music 链接
const introduction = document.getElementById('introduction'); // 简介
const album = document.getElementById('album'); // 专辑封面
const song_name = document.getElementById('song_name'); // 歌曲名称
const audioElement = document.getElementById('my_audio');
const audio_src = document.getElementById('audio_src'); // 音频地址

if (queryString == "joker_xue") {
    infoImage.src = 'https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/e4/c4/ed/e4c4ed38-5921-9073-f428-f76ba5437f62/mzl.kvvowdwi.jpg/2400x933vf-60.jpg'; // 根据参数值更改图片链接
    max_title.textContent = '薛之谦';
    am_link.href = 'https://music.apple.com/cn/artist/%E8%96%9B%E4%B9%8B%E8%B0%A6/160809474';
    introduction.innerHTML = '<p>选秀偶像、唱作歌手、浑身是梗的综艺明星、社交媒体上的段子手……这些身份全都属于薛之谦，也无法完全定义薛之谦。不过，音乐和舞台始终是他的平行世界，存放着他不被打扰、安静唱歌的灵魂。</p><p>2005 年，薛之谦以东方卫视《我型我秀》四强身份正式出道，签约上腾娱乐并于次年发行首张专辑。在港台流行歌占据半壁江山的 2000 年代，薛之谦的第一首主打歌《认真的雪》凭着一股令人动容的深情成功突围。然而，就像许多曾通过选秀舞台闯进演艺圈的追梦人，薛之谦一度闪耀，又渐渐沉寂，在后续十年左右的时间陷入了一段漫长的瓶颈期。依靠演员、投资等“副业”，他支撑着自己继续写歌、发歌，在 2007 到 2013 年间，发表了四张创作质量上乘的专辑，其中的代表单曲《你还要我怎样》保留了“薛氏情歌”典型的悲情和唯美。</p><p>命运对薛之谦开了一个玩笑，微博上记录生活的搞笑段子意外开启了他的“翻红”之路。2015 年，薛之谦签约海蝶音乐，乘势发行第一张亲自担任制作人的 EP《绅士》。重回大众视野的薛之谦也进入了音乐上的第二段高产时期，几乎以每年一张专辑的速度开始了在乐坛的“逆袭”。除了传统的华语抒情歌，薛之谦加大了合成器使用的比重，歌曲的色彩越发丰富。另外，他开始与同为选秀出身的后辈合作：他和唐汉霄分攻词、曲，共同打造社会批判歌曲《摩天大楼》；同样的创作形式也出现在张洢豪作曲的《肆无忌惮》中，可说是《明日之子》“导师”薛之谦对器重选手的提携。乐天搞怪支撑他走过低谷，深情唱作步履不停，就像他的英文名“Joker”一样，薛之谦用漫长的热爱与坚持在怪咖面具的背后刻画了一张认真的脸庞。</p>';
    album.src = 'https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/ca/b4/77/cab4776b-3389-f0fb-71bc-fb47b5691e18/28192928.jpg/592x592bb.webp';
    song_name.textContent = '天外来物';
    audio_src.src = `./src/music/${queryString}.mp3`;
} else if (queryString == "lee_young_ho") {
    infoImage.src = `./src/imgs/I_like/Music/${queryString}.jpg`; // 根据参数值更改图片链接
    max_title.textContent = '李荣浩';
    am_link.href = `https://music.apple.com/cn/artist/%E6%9D%8E%E8%8D%A3%E6%B5%A9/307674970`;
    introduction.innerHTML = '<p>在凭借首张专辑《模特》一举入围包括“最佳国语专辑奖”“最佳专辑制作人奖”在内的五项金曲奖奖项，并成为首位夺下“最佳新人奖”的大陆歌手之前，李荣浩早已在华语乐坛幕后默默耕耘了近十年。从词曲创作，包括和声、弦乐编写的编曲到乐器演奏，以及录混音和母带，李荣浩几乎能一手包揽歌曲发行前的多个环节，一人便是一整个创作团队，足以证明他扎实不俗的实力和对音乐一丝不苟的态度。</p><p>小时候的李荣浩是个不折不扣的“叛逆青年”，这位 1985 年出生于安徽省蚌埠市的男孩，在九岁时通过磁带接触到了音乐，一度为了学习乐器而辍学。而这样的痴迷也让他苦学吉他和低音提琴，在南京组乐队时便获得过江苏省第五届流行音乐大赛一等奖。之后李荣浩在年仅 20 岁时便开启了自己的音乐事业，在音乐杂志上发表过单曲，也编写过吉他丛书，逐渐在业内积累出经验与名声，让他得以为陈坤、赵薇、张信哲、李宇春等明星创作音乐、担任专辑制作人或演出嘉宾。</p><p>对吉他的娴熟驾驭力、长期学习低音提琴的经验，还有丰富的编曲和制作经验，让李荣浩在自己的唱作道路上走得踏实而沉稳，也不断为华语乐坛输送着源源不断的鲜活力量。《模特》看似横空出世，却是李荣浩厚积薄发的集大成之作，他成功从制作人转型成为全能创作歌手。磁性慵懒的声线、流畅顺滑的旋律和编曲，加上歌词中对于都市人心理的深刻描写，让他收获了广泛关注。金曲奖光环加成之外，2015 年音乐节目《我是歌手》又让更多人听到了李荣浩的声音——以细腻和纯粹的情感传达抚慰人心的力量。成功后的他一边维持着稳定的音乐产出，通过《李荣浩》《有理想》《耳朵》等专辑走出专属于自己的路线；一边为《何以笙箫默》《从你的全世界路过》等影视剧创作和演唱主题曲，参与杨丞琳、王俊凯、A-Lin 等歌手的作品创作，继续将名字留在华语乐坛的多个角落。同时他也在《乘风破浪》《卧底巨星》《下一任：前任》等电影中出演，或在《偶像练习生》《青春有你》《2019 中国好声音》等综艺节目中担任导师，一步步扩大着影响力。</p>';
    album.src = 'https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/b3/79/72/b379725c-bf76-318a-eee5-fa68d355f50b/190295170493.jpg/592x592bb.webp';
    song_name.textContent = '麻雀';
    audio_src.src = `./src/music/${queryString}.mp3`;
} else if (queryString == 'jay_chou') {
    infoImage.src = `./src/imgs/I_like/Music/${queryString}.jpg`;
    max_title.textContent = '周杰伦';
    am_link.href = 'https://music.apple.com/cn/artist/%E5%91%A8%E6%9D%B0%E4%BC%A6/300117743';
    introduction.innerHTML = '<p>似乎在不经意间，周杰伦的歌成为陪伴许多人青春、成长的 BGM，也成了华人流行乐文化中不断启发后辈的标杆“语言”。早在世纪之交时，或许很多人并没注意到，这位咬字“另类”、难掩个性的唱作歌手，正在开创性地将 R&B、嘻哈与摇滚、古典巧妙融合，创造并推动着华语乐坛标志性的中国风。而自他的作品横空出世之后，华语流行乐也前所未有地从经验、成就中跳脱，朝着唱作题材、曲风混搭的多元探索跃迁。</p><p>从第一张专辑《杰伦》开始，周杰伦开启了一场跨越两个世代的音乐冒险。十多年来，他与作词人方文山、编曲人洪敬尧、钟兴民、林迈可等优秀音乐人搭档，碰撞出无数灵感火花，带来东西合璧、探索中文说唱的《娘子》《双截棍》《龙拳》、拉开中国风流行大幕的《东风破》等多首重要作品。以《爱在西元前》为代表的音乐“时空穿梭”与故事“幻想”，更是突破了华语歌迷对流行音乐主题的认知。而不少作品飘逸出的弦乐和钢琴旋律，都体现出周杰伦打破古典和流行壁垒的超越性思维。</p><p>2000 年发片至出道 20 周年，周杰伦保持着金曲奖“最佳国语专辑奖”入围与获奖次数最多的记录。范围扩大至整个华语乐坛，他仍然是载誉等身的“天王级”歌手，奖项、销量和口碑均拥有经久不衰的号召力。成就之外，他的作品获得了大众歌迷的广泛认可，以《龙拳》《青花瓷》和《本草纲目》三度亮相春晚，足见他对中国人的广泛影响力。《蜗牛》《听妈妈的话》等具有深刻教育意义的歌，也通过歌迷传唱和学校教材的传播，影响着成长时的一代人。</p><p>从《杰伦》到《叶惠美》，周杰伦用他广受喜爱的前四张专辑诠释了音乐生涯重要的巅峰期。随后的 2004 年“无与伦比”演唱会为他骄傲的青春岁月做出了盛大定格。在《七里香》《夜曲》等后续经典“周氏”情歌热度不减的同时，他还通过电影《头文字 D》踏足影坛，旋即带着对影像创作和古典音乐的双重热情，呈现了导演处女作《不能说的秘密》。在 10 年代之前，他在音乐和影视两个领域均取得了不俗的成就，歌迷影迷一路相伴，也见证了他从阿尔发音乐的小助理终于成长为杰威尔音乐的“周董”。十年来的荣誉与感受通过音乐总结，温暖的《稻香》和表露心迹的《超人不会飞》都深深唱进了歌迷的内心。</p><p>在进入 10 年代之后，周杰伦的音乐脚步有所放缓，而他的事业野心却不止息。好莱坞、音乐剧、《中国好声音》导师席成为他展露活力的全新舞台，潮流服饰、电子竞技等“副业”也走得风生水起。人生大事与事业成熟相伴而来，结婚生子为他的音乐创作平添了一份生活的满足感，轻松惬意的《告白气球》和浪漫舞步的《Mojito》是他唱给这个世代的美好告白。而这些音乐中浓浓的热恋情绪和时空幻想，都不断地把人拉回到 2000 年“唱作新世代”大幕掀起，这位华语天才唱作人横空出世的那一刻。仿佛提醒着我们，无论乐坛风云如何涌动，时代如何变迁，周杰伦为华人文化和流行音乐带来的影响力已深深印刻在无数人的记忆里，无可取代，同样“无与伦比”。</p>';
    album.src = 'https://is1-ssl.mzstatic.com/image/thumb/Music114/v4/40/32/25/40322528-cb40-eb5f-20a6-baa6ba797014/886443549432.jpg/592x592bf.webp';
    song_name.textContent = '发如雪';
    audio_src.src = `./src/music/${queryString}.mp3`;
} else if (queryString == 'taylor_swift') {
    infoImage.src = 'https://is1-ssl.mzstatic.com/image/thumb/Features126/v4/2f/ad/3f/2fad3fe6-add8-39e1-5630-22a78876e2a6/119b08b7-bd1c-4813-9dc1-b4f8fe63a784.png/2400x933ea-60.jpg';
    max_title.textContent = 'Taylor Swift';
    am_link.href = `https://music.apple.com/cn/artist/taylor-swift/159260351`;
    introduction.innerHTML = '<p>推出三张乡村乐专辑后，Taylor Swift 从 2012 年的《Red》开始正式投向流行乐的怀抱。美国乡村音乐界对此表示“震惊”，但这没什么好惊讶的：毕竟谁都明白，一个 14 岁就能说服父母为了自己的演艺事业从宾夕法尼亚州城郊搬到纳什维尔的女孩，当然绝非池中之物。</p><p>Swift 的成名之路滴水不漏，令见证者惊叹不已，其实这很大程度上是因为她拥有与自己的雄心壮志相配的音乐天赋。早期充满青春气息的情歌已经预示了 2010 年那首《Speak Now》的诞生，她机智而犀利的作词功力在这首从容自信的歌里展露无遗，这些作品后来又进化为高度成熟的流行金曲。在以她出生年份命名的第五张专辑《1989》中，这份创作功力即使在 Max Martin 这样的金牌制作人面前也不遑多让。</p><p>Swift 的作品里，公众生活与私人生活的界线一向模糊难辨。歌曲中隐藏着不少指向现实生活的线索（比如关于围巾与咖啡店的歌词），但同时显而易见：或许只有 Swift 能在讲述“谢谢你，再见”这种私人爱情故事的同时，还保持着一份感性的优雅。在 2017 年的专辑《reputation》中，英雄与反派都是 Swift 在现实中的冤家，虽然这可能会被人当成是一出精心打造的大戏，但这些炫目的剧情，不过是吸引眼球的噱头。在喧嚣之下，Swift 为听众带来了她迄今为止最浪漫的专辑。</p>';
    album.src = 'https://is1-ssl.mzstatic.com/image/thumb/Music122/v4/59/13/5c/59135ccc-8425-415c-7f89-8aeada60088e/22UM1IM22440.rgb.jpg/592x592bf.webp';
    song_name.textContent = 'Lavender Haze';
    audio_src.src = `./src/music/${queryString}.mp3`;
} else if (queryString == 'adele') {
    infoImage.src = 'https://is1-ssl.mzstatic.com/image/thumb/Features116/v4/54/c9/ce/54c9ceca-1a84-bb21-084f-3840b48d0b4d/0bb71ebe-5c0d-4345-b531-a16a9fe870e4.png/2400x933ea-60.jpg';
    max_title.textContent = 'Adele';
    am_link.href = `https://music.apple.com/cn/artist/adele/262836961`;
    introduction.innerHTML = '<p>数十位英国艺人都和 Adele 有着相似的星路——在 BRIT 艺术学校求学，在推动视听分享的社交网站上崭露头角，成为流行明星。但是，要想在事业刚起步时就让人惊呼你的声音将成为永恒经典，必须要有常人不容易企及的天赋。</p><p>Adele 很小的时候便开始在北伦敦的家中磨炼自己的唱功，每天晚上要模仿美国灵歌天后 Etta James 长达一小时。在 2007 年，她首次在电视节目《Later…with Jools Holland》中亮相后，一切关于她和其他人的比较都烟消云散了：这个戴着超大耳环、有直率气场的女孩给人的感觉是独一无二的。她华丽的女中音将心碎、愤怒和懊悔等情绪都表现得极为自然，这把嗓子助她的首张专辑《19》与 2011 年的第二张专辑——从美国南方音乐中汲取灵感的《21》——大获成功。这两张专辑打破了无数纪录，甚至让 Adele 之后的声带手术成为全世界关注的热点新闻。还好最终手术丝毫无损她的歌喉，她在 2012 年格莱美颁奖典礼上的回归表演《Rolling In the Deep》就是最佳的证明。</p><p>2015 年，她只用了一个词就让世界再次认识了自己：她在一期《X Factor》的广告间歇时唱出了“Hello”，为自己即将征服世界的单曲与第三张专辑《25》掀开面纱。与前两张专辑一样，《25》颠覆了 21 世纪的流行乐标准，也让 Adele 成为史上首位三度赢得自然年内专辑销量冠军的艺人。如今的她已是一位母亲与妻子，早已将 20 多岁的感伤心痛留在身后。但是人们不会忘记，让她从懵懂少女成长为自信女性的，正是那独一无二的天籁之音。</p>';
    album.src = 'https://is1-ssl.mzstatic.com/image/thumb/Music116/v4/08/8c/24/088c2405-2e33-801b-5c38-e967f2c01e69/191404113974.png/592x592bb.webp';
    song_name.textContent = 'Hello';
    audio_src.src = `./src/music/${queryString}.mp3`;
} else if (queryString == 'jj_lin') {
    infoImage.src = 'https://is1-ssl.mzstatic.com/image/thumb/Features126/v4/b9/64/5a/b9645a4b-b66b-a62c-5998-5c99c5bd6e9b/mzl.obbxkbai.jpg/2400x933vf-60.jpg';
    max_title.textContent = '林俊杰';
    am_link.href = `https://music.apple.com/cn/artist/%E6%9E%97%E4%BF%8A%E6%9D%B0/216635866`;
    introduction.innerHTML = '<p>“在音乐世界里悠然行走的人”，2003 年，推出首张专辑《乐行者》的林俊杰，一直如此践行。这位全才型音乐人是人们金曲记忆中不可或缺的存在，他拥有辨识度清晰的音色与出色唱功，旺盛的创作力下十几年笔耕不辍，华语乐坛众多歌手，如阿杜、张惠妹、庾澄庆、王心凌、飞轮海、杨丞琳等，他们的作品幕后，都可以看到林俊杰的身影。</p><p>在林俊杰擅长的谱曲领域，他将古典、爵士、摇滚、EDM 和世界音乐等多种元素融入流行乐，跟随华语流行的生长。他来自新加坡，却自成一派谱写出描画地域气质与历史故事的中国风，2004 年的《江南》也是中国风代表名作，其后《曹操》用摇滚乐说三国故事，《醉赤壁》里中西方弦乐并行，拉响赤壁之战时期的爱情。以 2009 年林俊杰经历失声为分水岭，在其后的作品中，虽然中国历史题材更少表达，但中国风的乐曲却依旧常见， 2010 年专辑《她说》中的《一眼万年》，以及隐身在一众情歌当中的《I Am》，以笙箫、古筝呈现出东方的古典美与磅礴气势。</p><p>科幻是林俊杰善用的另一大题材，从 2005 年《木乃伊》《编号89757》《一千年以后》这三首科幻主题的歌讲述同一个爱情故事开始，人们认识到林俊杰用音乐紧密联系主题的能力。（例如“爱情三部曲”《学不会》《不存在的情人》《Love U U》和“黑暗三部曲”《黑武士》《黑暗骑士》《黑键》。）2019 年的单曲《Wonderland》则来到“一千年以后”，讲述《编号89757》中机器人苏醒后的独白。来到双维度 EP《幸存者》和《Like You Do》，不仅两张 EP 概念上相对应，其中的《While I Can》还重新填词《Wonderland》，连接起他自 2005 年构造的科幻宇宙，并以国际视野去实现音乐上的更多可能。</p><p>在出道时期接近的华语歌手大多放缓脚步的阶段，林俊杰一直在求新求变，电影音乐总监、潮牌主理人、创建电竞战队等“副业”也开展起来。在专辑《新地球》中，他跨国与 Jason Mraz、郑容和合作，次年还为滨崎步创作了《The GIFT》，擦出了更多音乐火花。同时林俊杰的音乐生涯也是他在唱功上进阶的见证，发声逐渐饱满宽厚，将共鸣表现到最大——“人头录音”专辑《和自己对话》，带来了沉浸式的聆听体验。而在综艺如《梦想的声音》担任导师，对歌曲的改编翻唱能力，更是让人们了解到林俊杰的才华。</p><p>登上春晚，传递奥运火炬，汶川地震创作《爱与希望》，疫情时期和孙燕姿共创《Stay With You》致敬医护人员，这些社会活动和温暖人心的公益之举，也都证明了除了流行创作之外，林俊杰自身积累出的高国民好感度。</p>';
    album.src = 'https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/b0/42/6e/b0426e5c-aa39-d28e-c184-fe1e0c7e5efd/dj.xjyxvhya.jpg/592x592bb.webp';
    song_name.textContent = '新地球';
    audio_src.src = `./src/music/${queryString}.mp3`;
}
audioElement.load();
});
